W4D3/app/controllers/cats_controller.rb

  def show
    @cat = Cat.includes(:owner, {rental_requests: :user}).find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["birth_date", "2012-02-20"], ["updated_at", "2017-11-29 21:47:19.586209"], ["id", 24]]