W5D1/goal_app/app/controllers/goals_controller.rb

INSERT INTO "goals" ("title", "details", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "goaltitle"], ["details", "goaldeets"], ["user_id", 46], ["created_at", "2017-12-04 22:17:12.222853"], ["updated_at", "2017-12-04 22:17:12.222853"]]
---
  def create
    goal = Goal.new(goal_params)
    goal.user_id = current_user.id
    if goal.save

SELECT  "goals".* FROM "goals" WHERE "goals"."user_id" = $1 AND "goals"."id" = $2 LIMIT $3  [["user_id", 104], ["id", 33], ["LIMIT", 1]]
UPDATE "goals" SET "title" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["title", "newgoaltitle"], ["updated_at", "2017-12-04 22:53:35.112333"], ["id", 37]]
---
  def update
    goal = current_user.goals.find_by(id: params[:id])

    if goal && goal.update_attributes(goal_params)

SELECT  "goals".* FROM "goals" WHERE "goals"."user_id" = $1 AND "goals"."id" = $2 LIMIT $3  [["user_id", 118], ["id", 43], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 43]]
---
  def destroy
    goal = current_user.goals.find_by(id: params[:id])
    unless goal && goal.destroy